# Задача №22

list_1 = set(list(map(int, input("введите числа через пробел ").split( ))))
list_2 = set(list(map(int, input("введите числа через пробел ").split( ))))
print(list_1.intersection(list_2))